SCREEN_WIDTH = 600
SCREEN_HEIGHT = 800

GRID_SIZE = 30 
BOARD_WIDTH_BLOCKS = 10  # Ширина игрового поля в блоках
BOARD_HEIGHT_BLOCKS = 20  # Высота игрового поля в блоках

PLAY_AREA_WIDTH = BOARD_WIDTH_BLOCKS * GRID_SIZE   # Общая ширина игровой области в пикселях
PLAY_AREA_HEIGHT = BOARD_HEIGHT_BLOCKS * GRID_SIZE  # Общая высота игровой области в пикселях
PLAY_AREA_X = (SCREEN_WIDTH - PLAY_AREA_WIDTH) // 2  # X-координата левого верхнего угла игровой области
PLAY_AREA_Y = SCREEN_HEIGHT - PLAY_AREA_HEIGHT - 50  # Y-координата левого верхнего угла игровой области

WHITE = (255, 255, 255)
BLACK = (0, 0, 0)
GRAY = (50, 50, 50)
LIGHT_GRAY = (100, 100, 100)
RED = (255, 0, 0)

COLORS = [
    (0, 255, 255),   # I (CYAN)    
    (255, 255, 0),   # O (YELLOW)   
    (128, 0, 128),   # T (PYRPLE)  
    (0, 255, 0),     # S (GREEN)
    (255, 0, 0),     # Z (RED)
    (0, 0, 255),     # J (BLUE)
    (255, 165, 0)    # L (ORANGE)
]

SHAPES = [
    # I
    [
        [[0, 0], [1, 0], [2, 0], [3, 0]],
        [[0, 0], [0, 1], [0, 2], [0, 3]]
    ],
    # O
    [
        [[0, 0], [0, 1], [1, 0], [1, 1]]
    ],
    # T
    [
        [[0, 1], [1, 0], [1, 1], [1, 2]],
        [[0, 1], [1, 1], [1, 2], [2, 1]],
        [[1, 0], [1, 1], [1, 2], [2, 1]],
        [[0, 1], [1, 0], [1, 1], [2, 1]]
    ],
    # S
    [
        [[0, 1], [0, 2], [1, 0], [1, 1]],
        [[0, 0], [1, 0], [1, 1], [2, 1]]
    ],
    # Z
    [
        [[0, 0], [0, 1], [1, 1], [1, 2]],
        [[0, 1], [1, 0], [1, 1], [2, 0]]
    ],
    # J
    [
        [[0, 0], [1, 0], [2, 0], [2, 1]],
        [[1, 0], [1, 1], [1, 2], [0, 2]],
        [[0, 0], [0, 1], [1, 1], [2, 1]],
        [[1, 0], [1, 1], [1, 2], [2, 0]]
    ],
    # L
    [
        [[0, 1], [1, 1], [2, 1], [2, 0]],
        [[1, 0], [1, 1], [1, 2], [0, 0]],
        [[0, 0], [0, 1], [1, 0], [2, 0]],
        [[1, 0], [1, 1], [1, 2], [2, 2]]
    ]
]
